Revit 2027 API
Element.ChangeTypeId Method
Overload List
Name | Description
ChangeTypeId(ElementId) |  Changes the type of the element.
ChangeTypeId(Document, ICollection<ElementId>, ElementId) |  Changes the type of all elements in the given set.
Top
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace